vlocity/DataRaptor/sfiEnergyConsoleFSOutageRequestJSONtoXML/sfiEnergyConsoleFSOutageRequestJSONtoXML_TargetOutXml.xml

<?xml version="1.0"?>
<soapenv:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <geolocations
            xmlns="http://soap.sforce.com/2005/09/outbound">
            <geolocation>
                <longitude>60</longitude>
                <latitude>26</latitude>
            </geolocation>
            <geolocation>
                <longitude>75.3457</longitude>
                <latitude>25.12</latitude>
            </geolocation>
            <geolocation>
                <longitude>123</longitude>
                <latitude>67</latitude>
            </geolocation>
            <geolocation>
                <longitude>-100</longitude>
                <latitude>-40</latitude>
            </geolocation>
            <geolocation>
                <longitude>99</longitude>
                <latitude>-50</latitude>
            </geolocation>
        </geolocations>
        <zipcodes
        xmlns="http://soap.sforce.com/2005/09/outbound">
            <zipcode>CV3 4LF</zipcode>
            <zipcode>80220</zipcode>
            <zipcode>EH15 3HR</zipcode>
        </zipcodes>
        <PartnerUrl>https://vexenergyqa.my.salesforce.com/services/Soap/u/41.0/00Df2000000NVjK</PartnerUrl>
        <EnterpriseUrl>https://vexenergyqa.my.salesforce.com/services/Soap/c/41.0/00Df2000000NVjK</EnterpriseUrl>
        <SessionId xsi:nil="true"></SessionId>
    </soapenv:Body>
</soapenv:Envelope>